{
  "id": "OB-014",
  "title": "Module Docking Matrix Optimization",
  "description": "Optimize docking matrix through 270-degree rotation and pattern overlay. Critical module attachment requires both spatial reorientation and signal combination for secure mechanical and electrical connection.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "tech_set2",
  "examples": [
    {
      "input": [
        [1, 0, 2],
        [3, 4, 0],
        [0, 5, 6]
      ],
      "output": [
        [2, 4, 6],
        [0, 4, 5],
        [1, 3, 4]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 0, 3],
        [4, 0, 5]
      ],
      "output": [
        [0, 2, 5],
        [1, 2, 3],
        [4, 2, 3]
      ]
    }
  ],
  "testInput": [
    [1, 2, 0],
    [0, 3, 4],
    [5, 0, 6]
  ],
  "testOutput": [
    [0, 3, 6],
    [2, 3, 4],
    [1, 3, 4]
  ],
  "hints": [
    "Space Force Protocol: Module docking optimization requires counter-clockwise rotation and signal overlay to establish secure mechanical and electrical connections.",
    "Phase 1 - Matrix Reorientation: Apply 270-degree clockwise rotation (equivalent to 90-degree counter-clockwise) to align docking interfaces. Element at (row,col) moves to (gridSize-1-col, row).",
    "Phase 2 - Signal Overlay: Perform OR operation between the rotated matrix and the original matrix to combine all active connection points and signal pathways.",
    "Technical Implementation: First rotate 270° clockwise, then apply element-wise OR operation between original and rotated grids to merge connection patterns.",
    "Validation Check: Verify the grid shows counter-clockwise rotation and all connection points from both original and rotated configurations are preserved (OR logic).",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines 270° Clockwise Rotation with OR Operation to simulate module docking requiring both spatial alignment and connection pathway integration protocols."
  ]
}
