{
  "id": "OB-026",
  "title": "Beacon Signal Synchronization Protocol",
  "description": "Synchronize beacon signals through 90-degree rotation and pattern completion. Emergency beacon systems require both spatial reorientation and signal gap filling for optimal distress transmission coverage.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "alien_language",
  "examples": [
    {
      "input": [
        [1, 0, 2],
        [3, 4, 0],
        [0, 5, 6]
      ],
      "output": [
        [7, 3, 1],
        [5, 4, 7],
        [6, 7, 2]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 0, 3],
        [4, 0, 5]
      ],
      "output": [
        [4, 2, 7],
        [7, 7, 1],
        [5, 3, 7]
      ]
    }
  ],
  "testInput": [
    [1, 2, 0],
    [0, 3, 4],
    [5, 0, 6]
  ],
  "testOutput": [
    [5, 7, 1],
    [7, 3, 2],
    [6, 4, 7]
  ],
  "hints": [
    "Space Force Protocol: Beacon signal synchronization requires 90-degree rotation and pattern completion to establish comprehensive emergency transmission coverage.",
    "Phase 1 - Signal Reorientation: Apply 90-degree clockwise rotation to reorient the beacon signal matrix. Each element moves: (row,col) → (col, gridSize-1-row).",
    "Phase 2 - Signal Completion: Fill all empty spaces (value 0) with value 7 to represent completed beacon transmission nodes and emergency signal amplifiers.",
    "Technical Implementation: First rotate the grid 90° clockwise, then replace all 0 values with 7 for complete beacon coverage and signal transmission.",
    "Validation Check: Verify the grid orientation has changed 90° and no empty spaces remain - all positions must show active beacon signals (no zeros).",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines 90° Clockwise Rotation with Pattern Completion to simulate beacon signal synchronization requiring both spatial reorientation and systematic signal completion protocols."
  ]
}
