{
  "id": "OB-016",
  "title": "Navigation Compass Recalibration",
  "description": "Recalibrate navigation compass through vertical translation and duplicate masking. Advanced navigation requires both directional shift and interference elimination for accurate stellar positioning.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "alien_language",
  "examples": [
    {
      "input": [
        [1, 2, 3],
        [0, 4, 0],
        [5, 6, 7]
      ],
      "output": [
        [0, 4, 0],
        [5, 6, 7],
        [0, 2, 3]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 3, 4],
        [0, 5, 0]
      ],
      "output": [
        [2, 3, 4],
        [0, 5, 0],
        [0, 0, 0]
      ]
    }
  ],
  "testInput": [
    [1, 0, 2],
    [3, 4, 5],
    [0, 6, 0]
  ],
  "testOutput": [
    [3, 4, 5],
    [0, 6, 0],
    [0, 0, 2]
  ],
  "hints": [
    "Space Force Protocol: Navigation compass recalibration requires vertical translation and duplicate elimination to establish accurate stellar positioning references.",
    "Phase 1 - Directional Shift: Apply vertical translation by moving each row one position down, with the bottom row wrapping to the top of the grid.",
    "Phase 2 - Interference Elimination: Apply NOT operation to eliminate duplicate signals - any position appearing in both original and shifted grids becomes 0 (interference canceled).",
    "Technical Implementation: First shift all rows down by one position (with wraparound), then perform element-wise NOT operation to cancel matching positions.",
    "Validation Check: Verify rows have shifted vertically and positions with duplicate readings show interference cancellation (value 0) for clean navigation signals.",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines Translation/Shift with NOT Operation to simulate navigation compass recalibration requiring both positional adjustment and signal interference elimination protocols."
  ]
}
