{
  "id": "OB-018",
  "title": "Cargo Bay Environmental Control",
  "description": "Control cargo bay environment through 180-degree rotation and sequence progression. Critical cargo storage requires both spatial reorientation and temporal tracking for optimal preservation conditions.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "alien_language",
  "examples": [
    {
      "input": [
        [1, 0, 2],
        [3, 4, 0],
        [0, 5, 6]
      ],
      "output": [
        [7, 6, 1],
        [1, 5, 4],
        [3, 1, 2]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 3, 4],
        [5, 0, 6]
      ],
      "output": [
        [7, 1, 6],
        [5, 4, 3],
        [1, 2, 1]
      ]
    }
  ],
  "testInput": [
    [1, 2, 0],
    [0, 3, 4],
    [5, 0, 6]
  ],
  "testOutput": [
    [7, 1, 6],
    [1, 4, 4],
    [1, 3, 2]
  ],
  "hints": [
    "Space Force Protocol: Cargo bay environmental control requires 180-degree rotation and temporal sequence advancement to maintain optimal preservation conditions.",
    "Phase 1 - Spatial Reorientation: Apply 180-degree rotation to flip the environmental control matrix. Element at position (row,col) moves to position (gridSize-1-row, gridSize-1-col).",
    "Phase 2 - Temporal Progression: Increment all non-zero values by 1 to represent temporal advancement of environmental cycles, with 0 values remaining unchanged.",
    "Technical Implementation: First rotate 180 degrees (flip both horizontally and vertically), then increment all non-zero values by 1 for temporal tracking.",
    "Validation Check: Verify the grid has been rotated 180 degrees and all active environmental systems (non-zero values) show temporal progression (incremented by 1).",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines 180° Rotation with Sequence Increment to simulate cargo bay environmental control requiring both spatial reorientation and temporal advancement protocols."
  ]
}
