{
  "id": "PL-002",
  "title": "Launch Grid Rotation",
  "description": "The communications array got stuck trying to rotate antenna positioning data 90 degrees. Instead of simply turning the coordinate map, it began physically rotating the entire 50-ton antenna assembly, creating a slow-motion disaster as cables twisted into knots. 90-degree rotations combine spatial reasoning with coordinate transformation. AI must understand how positions change in 2D space while maintaining object relationships - a complex geometric abstraction that requires true spatial intelligence. Guardian, critical update from Space Command! The primary launch vector for Operation Silent Sentry has been compromised by solar flare activity. We need an immediate recalibration. The launch grid, a 3x3 matrix representing targeting coordinates, must be rotated 90 degrees clockwise. This ensures the payload avoids the radiation surge and reaches its designated orbit. Your precision is paramount – the success of this multi-billion dollar asset and national security depends on your swift and accurate adjustment. Execute the rotation and confirm the new grid configuration.",
  "category": "🚀 Pre-Launch Ops",
  "difficulty": "Basic",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3500,
  "requiredRankLevel": 1,
  "emojiSet": "nav_alerts",
  "examples": [
    {
      "input": [
        [
          1,
          2,
          3
        ],
        [
          4,
          5,
          6
        ],
        [
          7,
          8,
          9
        ]
      ],
      "output": [
        [
          7,
          4,
          1
        ],
        [
          8,
          5,
          2
        ],
        [
          9,
          6,
          3
        ]
      ]
    },
    {
      "input": [
        [
          0,
          1,
          0
        ],
        [
          2,
          0,
          3
        ],
        [
          0,
          4,
          0
        ]
      ],
      "output": [
        [
          0,
          2,
          0
        ],
        [
          4,
          0,
          1
        ],
        [
          0,
          3,
          0
        ]
      ]
    }
  ],
  "testInput": [
    [
      9,
      8,
      7
    ],
    [
      6,
      5,
      4
    ],
    [
      3,
      2,
      1
    ]
  ],
  "testOutput": [
    [
      3,
      6,
      9
    ],
    [
      2,
      5,
      8
    ],
    [
      1,
      4,
      7
    ]
  ],
  "hints": [
    "When you turn a picture sideways, you just know what it looks like. But computers have to figure out where every single dot should move when you spin something. It's like doing a puzzle where every piece changes places.",
    "Think about when you turn your head to look at something sideways. You don't have to think about it - you just do it. But a computer is like someone who has to carefully move every toy in your room to new spots just to see what it looks like from a different angle.",
    "It's like playing with a kaleidoscope. When you turn it, all the pretty colors move to new places, but you can still see it's the same pattern. A computer would have to track where each tiny piece of color went and calculate its new home.",
    "Rotate the entire grid 90 degrees clockwise 🔁.",
    "The element at (row, col) moves to (col, gridSize - 1 - row).",
    "Imagine turning a square piece of paper one quarter turn to the right."
  ]
}