{
  "id": "PL-003",
  "title": "Launch Trajectory Rotation",
  "description": "Medical bay scanners couldn't figure out how to rotate X-ray images 90 degrees for proper viewing. The AI kept trying to physically rotate the injured astronaut on the examination table instead of just turning the digital image on the screen. 90-degree rotations combine spatial reasoning with coordinate transformation. AI must understand how positions change in 2D space while maintaining object relationships - a complex geometric abstraction that requires true spatial intelligence. Rotate trajectory control grid 90° clockwise 🔁 to align with updated launch vector.",
  "category": "🚀 Pre-Launch Ops",
  "difficulty": "Advanced",
  "gridSize": 4,
  "timeLimit": null,
  "basePoints": 19500,
  "requiredRankLevel": 1,
  "emojiSet": "status_alerts",
  "examples": [
    {
      "input": [
        [
          1,
          0,
          0,
          2
        ],
        [
          0,
          3,
          4,
          0
        ],
        [
          0,
          5,
          6,
          0
        ],
        [
          7,
          0,
          0,
          8
        ]
      ],
      "output": [
        [
          7,
          0,
          0,
          1
        ],
        [
          0,
          5,
          3,
          0
        ],
        [
          0,
          6,
          4,
          0
        ],
        [
          8,
          0,
          0,
          2
        ]
      ]
    },
    {
      "input": [
        [
          0,
          2,
          0,
          0
        ],
        [
          3,
          0,
          0,
          4
        ],
        [
          0,
          0,
          5,
          0
        ],
        [
          0,
          0,
          6,
          7
        ]
      ],
      "output": [
        [
          0,
          0,
          3,
          0
        ],
        [
          0,
          0,
          0,
          2
        ],
        [
          6,
          5,
          0,
          0
        ],
        [
          7,
          4,
          0,
          0
        ]
      ]
    }
  ],
  "testInput": [
    [
      0,
      1,
      0,
      2
    ],
    [
      3,
      0,
      4,
      0
    ],
    [
      0,
      5,
      0,
      6
    ],
    [
      7,
      0,
      8,
      0
    ]
  ],
  "testOutput": [
    [
      7,
      3,
      0,
      0
    ],
    [
      0,
      5,
      1,
      0
    ],
    [
      8,
      4,
      0,
      2
    ],
    [
      0,
      6,
      0,
      0
    ]
  ],
  "hints": [
    "When you turn a picture sideways, you just know what it looks like. But computers have to figure out where every single dot should move when you spin something. It's like doing a puzzle where every piece changes places.",
    "Think about when you turn your head to look at something sideways. You don't have to think about it - you just do it. But a computer is like someone who has to carefully move every toy in your room to new spots just to see what it looks like from a different angle.",
    "It's like playing with a kaleidoscope. When you turn it, all the pretty colors move to new places, but you can still see it's the same pattern. A computer would have to track where each tiny piece of color went and calculate its new home.",
    "Rotate the entire grid 90° clockwise 🔁.",
    "Rows become columns from left to right.",
    "⬛ rotates like any other value."
  ]
}