{
  "id": "OB-022",
  "title": "Robotic Arm Coordination Matrix",
  "description": "Coordinate robotic arm systems through vertical reflection and logical masking. Advanced robotic control requires both spatial transformation and signal interference elimination for precise mechanical operation.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "alien_language",
  "examples": [
    {
      "input": [
        [1, 0, 2],
        [3, 4, 0],
        [0, 5, 6]
      ],
      "output": [
        [0, 5, 6],
        [3, 0, 0],
        [1, 0, 2]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 0, 3],
        [4, 0, 5]
      ],
      "output": [
        [4, 0, 5],
        [2, 0, 3],
        [0, 1, 0]
      ]
    }
  ],
  "testInput": [
    [1, 2, 0],
    [0, 3, 4],
    [5, 0, 6]
  ],
  "testOutput": [
    [5, 0, 6],
    [0, 3, 4],
    [1, 2, 0]
  ],
  "hints": [
    "Space Force Protocol: Robotic arm coordination requires vertical reflection and logical masking to eliminate interference and establish precise mechanical control patterns.",
    "Phase 1 - Spatial Transformation: Apply vertical reflection by flipping the robotic control matrix top-to-bottom. The first row becomes the last row, middle row stays in place.",
    "Phase 2 - Interference Masking: Apply AND operation with the original grid to filter control signals. Only positions where both original and reflected grids have non-zero values remain active.",
    "Technical Implementation: First reflect vertically (swap rows), then perform element-wise AND operation between original and reflected grids to eliminate interference.",
    "Validation Check: Verify the grid orientation is inverted vertically and only positions with dual-active signals (non-zero in both grids) remain operational for precise control.",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines Vertical Reflection with AND Operation to simulate robotic arm coordination requiring both spatial reorientation and interference elimination protocols."
  ]
}
