{
  "id": "OB-025",
  "title": "Fuel System Optimization Matrix",
  "description": "Optimize fuel systems through horizontal reflection and interference elimination. Advanced fuel management requires both spatial transformation and signal conflict resolution for optimal propulsion efficiency.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "vague_symbols",
  "examples": [
    {
      "input": [
        [1, 0, 2],
        [3, 4, 0],
        [0, 5, 6]
      ],
      "output": [
        [0, 0, 1],
        [3, 0, 3],
        [6, 5, 0]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 0, 3],
        [4, 0, 5]
      ],
      "output": [
        [0, 1, 0],
        [3, 0, 2],
        [5, 0, 4]
      ]
    }
  ],
  "testInput": [
    [1, 2, 0],
    [0, 3, 4],
    [5, 0, 6]
  ],
  "testOutput": [
    [0, 2, 1],
    [4, 3, 0],
    [6, 0, 5]
  ],
  "hints": [
    "Space Force Protocol: Fuel system optimization requires horizontal reflection and interference elimination to resolve propulsion conflicts and establish efficient fuel flow patterns.",
    "Phase 1 - Flow Reorientation: Apply horizontal reflection to flip the fuel flow matrix left-to-right. Each row's elements reverse order while maintaining vertical structure.",
    "Phase 2 - Interference Elimination: Apply NOT operation to eliminate conflicting signals - any position appearing in both original and reflected grids becomes 0 (interference canceled).",
    "Technical Implementation: First reflect horizontally (swap columns), then perform element-wise NOT operation to cancel matching positions between original and reflected grids.",
    "Validation Check: Verify the grid orientation has been mirrored horizontally and positions with duplicate readings show interference cancellation (value 0) for clean fuel flow.",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines Horizontal Reflection with NOT Operation to simulate fuel system optimization requiring both spatial reorientation and signal interference elimination protocols."
  ]
}
