{
  "id": "OB-021",
  "title": "Star Tracker Navigation Matrix",
  "description": "Navigate star tracker matrix through vertical translation and pattern completion. Advanced stellar navigation requires both positional shift and systematic gap filling for accurate celestial positioning.",
  "category": "⚙️ Onboard Systems",
  "difficulty": "Intermediate",
  "gridSize": 3,
  "timeLimit": null,
  "basePoints": 3000,
  "requiredRankLevel": 2,
  "emojiSet": "vague_symbols",
  "examples": [
    {
      "input": [
        [1, 0, 2],
        [3, 4, 0],
        [0, 5, 6]
      ],
      "output": [
        [3, 4, 7],
        [7, 5, 6],
        [1, 7, 2]
      ]
    },
    {
      "input": [
        [0, 1, 0],
        [2, 0, 3],
        [4, 0, 5]
      ],
      "output": [
        [2, 7, 3],
        [4, 7, 5],
        [7, 1, 7]
      ]
    }
  ],
  "testInput": [
    [1, 2, 0],
    [0, 3, 4],
    [5, 0, 6]
  ],
  "testOutput": [
    [7, 3, 4],
    [5, 7, 6],
    [1, 2, 7]
  ],
  "hints": [
    "Space Force Protocol: Star tracker navigation requires vertical translation and pattern completion to establish accurate celestial positioning references.",
    "Phase 1 - Matrix Translation: Apply vertical shift by moving each row one position down, with the bottom row wrapping to the top of the grid.",
    "Phase 2 - Navigation Completion: Fill all empty spaces (value 0) with value 7 to represent completed stellar reference points and navigation markers.",
    "Technical Implementation: First shift all rows down by one position (with wraparound), then replace all 0 values with 7 for complete navigation coverage.",
    "Validation Check: Verify rows have shifted vertically and no empty spaces remain - all positions must show active stellar references (no zeros).",
    "Created by: Cascade with Claude 4 Sonnet Thinking. Design rationale: Combines Translation/Shift with Pattern Completion to simulate star tracker navigation requiring both positional adjustment and systematic reference completion protocols."
  ]
}
