{
  "id": "SEC-100",
  "title": "Defense matrix Rotation Analysis",
  "description": "The waste management system tried to rotate disposal schedules by 270 degrees but applied three separate 90-degree transforms to the actual rotating waste compactor. The machine spun through three slow quarter-turns, taking 45 minutes to complete what should have been a 5-second data adjustment. 270-degree rotations are particularly challenging because they require understanding that three quarter-turns equal one three-quarter turn, not just applying 90-degree logic three times. This tests deeper spatial reasoning and transformation composition. Analyze the defense matrix by rotating the input grid 270 degrees clockwise 游대游대游대.",
  "category": "游 Security Systems",
  "difficulty": "Intermediate",
  "gridSize": 4,
  "timeLimit": null,
  "basePoints": 4125,
  "requiredRankLevel": 1,
  "emojiSet": "status_alerts",
  "examples": [
    {
      "input": [
        [
          9,
          6,
          6,
          9
        ],
        [
          7,
          9,
          8,
          4
        ],
        [
          3,
          7,
          0,
          0
        ],
        [
          8,
          0,
          6,
          0
        ]
      ],
      "output": [
        [
          9,
          4,
          0,
          0
        ],
        [
          6,
          8,
          0,
          6
        ],
        [
          6,
          9,
          7,
          0
        ],
        [
          9,
          7,
          3,
          8
        ]
      ]
    },
    {
      "input": [
        [
          2,
          6,
          3,
          9
        ],
        [
          8,
          0,
          2,
          3
        ],
        [
          7,
          7,
          1,
          5
        ],
        [
          6,
          4,
          9,
          4
        ]
      ],
      "output": [
        [
          9,
          3,
          5,
          4
        ],
        [
          3,
          2,
          1,
          9
        ],
        [
          6,
          0,
          7,
          4
        ],
        [
          2,
          8,
          7,
          6
        ]
      ]
    }
  ],
  "testInput": [
    [
      0,
      4,
      9,
      4
    ],
    [
      8,
      0,
      1,
      8
    ],
    [
      3,
      9,
      2,
      6
    ],
    [
      2,
      9,
      8,
      7
    ]
  ],
  "testOutput": [
    [
      4,
      8,
      6,
      7
    ],
    [
      9,
      1,
      2,
      8
    ],
    [
      4,
      0,
      9,
      9
    ],
    [
      0,
      8,
      3,
      2
    ]
  ],
  "hints": [
    "This is like spinning a toy three times to the right instead of once to the left to end up in the same place. You know they're the same, but computers have to think step-by-step through each turn.",
    "Imagine you're playing 'Simon Says' and Simon says 'turn around 3/4 of the way.' You'd just turn almost all the way around and stop. But a computer might think it has to turn a little bit, then turn again, then turn again, taking much longer to get to the same place.",
    "It's like when you're unscrewing a jar lid. You know you need to turn it mostly around to the left, but a computer might think it needs to turn it a little to the right three times instead of just turning left once. Both ways work, but one is much sillier.",
    "Rotate the entire grid 270 degrees clockwise 游대游대游대 ( turn to the right). You can also think of this as 90 degrees counter-clockwise 游댃 (췊 turn to the left).",
    "The leftmost column becomes the top row, reading from left to right.",
    "Each row in the original becomes a column in the result, with order shifted accordingly."
  ],
  "transformationType": "rotation_270deg",
  "generated": true
}